; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v5 ?v1)
             (pred_8 ?v7 ?v2)
             (pred_6 ?v5 ?v2)
             (pred_11 ?v10 ?v5 )
	     (pred_2 ?v5)
             (pred_10 ?v11)
             (pred_4 ?v7)
             (pred_12 ?v2)
             (pred_9 ?v5)
             (pred_7 ?v7)
             (pred_3 ?v5)
             (pred_5 ))



(:action op_4
:parameters (?v8 ?v3 ?v9 ?v6)
:precondition (and (pred_10 ?v8) (pred_10 ?v3) (pred_4 ?v9) (pred_12 ?v6)
          (pred_1 ?v8 ?v3) (pred_8 ?v9 ?v6)
                   (pred_6 ?v3 ?v6) (pred_2 ?v8) 
                   (pred_9 ?v3) (pred_7 ?v9))
:effect (and  (pred_3 ?v3) (not (pred_9 ?v3))))


(:action op_3
:parameters (?v8 ?v4)
:precondition (and (pred_10 ?v8) (pred_10 ?v4)
               (pred_2 ?v8) (pred_1 ?v8 ?v4) (pred_3 ?v4))
:effect (and (pred_2 ?v4) (not (pred_2 ?v8))))

(:action op_1
:parameters (?v8 ?v9)
:precondition (and (pred_10 ?v8) (pred_4 ?v9) 
                  (pred_2 ?v8) (pred_11 ?v9 ?v8) (pred_5 ))
:effect (and (pred_7 ?v9)
   (not (pred_11 ?v9 ?v8)) (not (pred_5 ))))


(:action op_2
:parameters (?v8 ?v13 ?v12)
:precondition (and (pred_10 ?v8) (pred_4 ?v13) (pred_4 ?v12)
                  (pred_2 ?v8) (pred_7 ?v12) (pred_11 ?v13 ?v8))
:effect (and (pred_7 ?v13) (pred_11 ?v12 ?v8)
        (not (pred_7 ?v12)) (not (pred_11 ?v13 ?v8))))

(:action op_5
:parameters (?v8 ?v9)
:precondition (and (pred_10 ?v8) (pred_4 ?v9) 
                  (pred_2 ?v8) (pred_7 ?v9))
:effect (and (pred_5 ) (pred_11 ?v9 ?v8) (not (pred_7 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_13 obj_11 obj_15 obj_14 obj_03 obj_02 obj_08 obj_22 obj_17 obj_19 obj_21 obj_06 obj_04 obj_16 obj_12
    obj_05 obj_20 obj_01
    obj_18 obj_07 obj_10
    )

    (:init
       (pred_5)

       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_15)
       (pred_10 obj_14)
       (pred_10 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_10 obj_22)
       (pred_10 obj_17)
       (pred_10 obj_19)
       (pred_10 obj_21)
       (pred_10 obj_06)
       (pred_10 obj_04)
       (pred_10 obj_16)
       (pred_10 obj_12)
       (pred_12 obj_05)
       (pred_12 obj_20)
       (pred_12 obj_01)
       (pred_4 obj_18)
       (pred_4 obj_07)
       (pred_4 obj_10)

       (pred_1 obj_09 obj_14)
       (pred_1 obj_09 obj_13)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_09)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_15 obj_08)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_14 obj_22)
       (pred_1 obj_14 obj_03)
       (pred_1 obj_14 obj_09)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_03 obj_02)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_03 obj_14)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_02 obj_08)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_02 obj_03)
       (pred_1 obj_08 obj_21)
       (pred_1 obj_08 obj_15)
       (pred_1 obj_08 obj_02)
       (pred_1 obj_22 obj_06)
       (pred_1 obj_22 obj_17)
       (pred_1 obj_22 obj_14)
       (pred_1 obj_17 obj_04)
       (pred_1 obj_17 obj_19)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_17 obj_22)
       (pred_1 obj_19 obj_16)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_19 obj_02)
       (pred_1 obj_19 obj_17)
       (pred_1 obj_21 obj_12)
       (pred_1 obj_21 obj_08)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_06 obj_22)
       (pred_1 obj_04 obj_16)
       (pred_1 obj_04 obj_17)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_16 obj_12)
       (pred_1 obj_16 obj_19)
       (pred_1 obj_16 obj_04)
       (pred_1 obj_12 obj_21)
       (pred_1 obj_12 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_08)
       (pred_9 obj_03)
       (pred_6  obj_11 obj_05)
       (pred_6  obj_08 obj_20)
       (pred_6  obj_03 obj_01)
       (pred_3 obj_09)
       (pred_3 obj_13)
       (pred_3 obj_15)
       (pred_3 obj_14)
       (pred_3 obj_02)
       (pred_3 obj_22)
       (pred_3 obj_17)
       (pred_3 obj_19)
       (pred_3 obj_21)
       (pred_3 obj_06)
       (pred_3 obj_04)
       (pred_3 obj_16)
       (pred_3 obj_12)

       (pred_8  obj_18 obj_05)
       (pred_8  obj_07 obj_20)
       (pred_8  obj_10 obj_01)
       (pred_11 obj_18 obj_17)
       (pred_11 obj_07 obj_12)
       (pred_11 obj_10 obj_19)
       (pred_2 obj_17)
    )

    (:goal (and
       (pred_11 obj_07 obj_14)
    ))
(:constraints
  (always (not (pred_2 obj_21)))
)
)

; plan
1. (op_3 obj_17 obj_19)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_19)
   goals met: 0 of 1
2. (op_3 obj_19 obj_16)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_16)
   goals met: 0 of 1
3. (op_3 obj_16 obj_12)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_07)
   deleted: (pred_11 obj_07 obj_12) (pred_5)
   added: (pred_7 obj_07)
   goals met: 0 of 1
5. (op_3 obj_12 obj_16)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_16)
   goals met: 0 of 1
6. (op_3 obj_16 obj_19)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_19)
   goals met: 0 of 1
7. (op_3 obj_19 obj_17)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_17)
   goals met: 0 of 1
8. (op_3 obj_17 obj_22)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_22)
   goals met: 0 of 1
9. (op_3 obj_22 obj_14)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_14)
   goals met: 0 of 1
10. (op_5 obj_14 obj_07)
   deleted: (pred_7 obj_07)
   added: (pred_5) (pred_11 obj_07 obj_14)
   goals met: 1 of 1
